## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_secret.argocd_manager will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_manager" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # data.kubernetes_secret.loadtesting_manager will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "loadtesting_manager" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # argocd_application.keda-scaledobject will be created
+   resource "argocd_application" "keda-scaledobject" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-cron"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }

+           source {
+               path            = "charts/keda"
+               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf"
+               target_revision = "main"

+               helm {
+                   release_name = "keda-cron"
                }
            }
        }
    }

  # argocd_cluster.do-cinema will be updated in-place
!   resource "argocd_cluster" "do-cinema" {
        id         = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com/do-cinema"
        name       = "do-cinema"
-       project    = "" -> null
        # (3 unchanged attributes hidden)

!       config {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
!           bearer_token = (sensitive value)
-           password     = (sensitive value)
-           username     = "" -> null

!           tls_client_config {
              # Warning: this attribute value will no longer be marked as sensitive
              # after applying this change.
!               ca_data     = (sensitive) -> (known after apply)
-               cert_data   = "" -> null
-               key_data    = (sensitive value)
-               server_name = "" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # argocd_cluster.do-loadtesting will be updated in-place
!   resource "argocd_cluster" "do-loadtesting" {
        id         = "https://82282b3b-3063-4462-92c5-160718170247.k8s.ondigitalocean.com/do-loadtesting"
        name       = "do-loadtesting"
-       project    = "" -> null
        # (3 unchanged attributes hidden)

!       config {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
!           bearer_token = (sensitive value)
-           password     = (sensitive value)
-           username     = "" -> null

!           tls_client_config {
              # Warning: this attribute value will no longer be marked as sensitive
              # after applying this change.
!               ca_data     = (sensitive) -> (known after apply)
-               cert_data   = "" -> null
-               key_data    = (sensitive value)
-               server_name = "" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # kubernetes_secret.argocd-tls will be updated in-place
!   resource "kubernetes_secret" "argocd-tls" {
        id                             = "istio-system/argocd-tls"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.argocd_manager will be updated in-place
!   resource "kubernetes_secret" "argocd_manager" {
        id                             = "kube-system/argocd-manager"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.digital-ocean-secret will be updated in-place
!   resource "kubernetes_secret" "digital-ocean-secret" {
        id                             = "kube-system/digital-ocean-secret"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.digital-ocean-secret-loadtesting will be updated in-place
!   resource "kubernetes_secret" "digital-ocean-secret-loadtesting" {
        id                             = "kube-system/digital-ocean-secret"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.docker_login_secret will be updated in-place
!   resource "kubernetes_secret" "docker_login_secret" {
        id                             = "cinema/docker-login"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.loadtesting_manager will be updated in-place
!   resource "kubernetes_secret" "loadtesting_manager" {
        id                             = "kube-system/loadtesting-manager"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.wayofthesys-tls will be updated in-place
!   resource "kubernetes_secret" "wayofthesys-tls" {
        id                             = "istio-system/wayofthesys-org-tls"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.wayofthesys-tls-loadtesting will be updated in-place
!   resource "kubernetes_secret" "wayofthesys-tls-loadtesting" {
        id                             = "istio-system/wayofthesys-org-tls"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.zerossl-eab-hmac-key will be updated in-place
!   resource "kubernetes_secret" "zerossl-eab-hmac-key" {
        id                             = "cert-manager/zerossl-eab-hmac-key"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id will be updated in-place
!   resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
        id                             = "cert-manager/zerossl-eab-hmac-key-id"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id-loadtesting will be updated in-place
!   resource "kubernetes_secret" "zerossl-eab-hmac-key-id-loadtesting" {
        id                             = "cert-manager/zerossl-eab-hmac-key-id"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.zerossl-eab-hmac-key-loadtesting will be updated in-place
!   resource "kubernetes_secret" "zerossl-eab-hmac-key-loadtesting" {
        id                             = "cert-manager/zerossl-eab-hmac-key"
+       wait_for_service_account_token = true
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_service_account.loadtesting_manager will be updated in-place
!   resource "kubernetes_service_account" "loadtesting_manager" {
        id                              = "kube-system/loadtesting-manager"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "loadtesting-manager-token-7nsqz" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 15 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
